Repository: wolfDiesel/nes-extractor
Catalog: src/NesExtractor/Resources/Strings.*.resx
Languages: ru

# Menu.File
source: File
ru: Файл

# Menu.File.Open
source: Open...
ru: Открыть...

# Menu.File.CloseTab
source: Close Tab
ru: Закрыть таб

# Menu.File.BatchExport
source: Batch Export...
ru: Массовый экспорт...

# Menu.File.Exit
source: Exit
ru: Выйти

# Menu.Help.About
source: About
ru: О программе

# Menu.Language
source: Language
ru: Язык

# About.Title
source: About NesExtractor
ru: О программе NesExtractor

# About.Description
source: Utility for analyzing and extracting data from NES ROM files.
ru: Утилита для анализа и извлечения данных из NES ROM файлов.

# About.Version
source: Version: {0}
ru: Версия: {0}

# About.Close
source: Close
ru: Закрыть

# Tabs.Close.Tooltip
source: Close (Ctrl+W)
ru: Закрыть (Ctrl+W)

# Empty.Welcome.Title
source: Welcome to NesExtractor
ru: Добро пожаловать в NesExtractor

# Empty.Welcome.Subtitle
source: A utility to analyze and extract data from NES ROM files
ru: Утилита для анализа и извлечения данных из NES ROM файлов

# Empty.Features.1
source: ✓ Supports iNES 1.0 and NES 2.0
ru: ✓ Поддержка iNES 1.0 и NES 2.0

# Empty.Features.2
source: ✓ Extracts cartridge information
ru: ✓ Извлечение информации о картридже

# Empty.Features.3
source: ✓ Visualizes CHR ROM graphics
ru: ✓ Визуализация графики CHR ROM

# Empty.Features.4
source: ✓ Exports tiles to PNG
ru: ✓ Экспорт тайлов в PNG

# Empty.OpenButton
source: 🎮 Open NES file...
ru: 🎮 Открыть NES файл...

# Empty.OpenHint
source: Or use Ctrl+O
ru: Или используйте Ctrl+O

# File.Info.Title
source: 📋 Cartridge info
ru: 📋 Информация о картридже

# File.Label
source: File:
ru: Файл:

source: File size:
ru: Размер файла:

# File.Format
source: Format:
ru: Формат:

# Rom.Info.Title
source: ROM data
ru: ROM данные

# PrgRom.Label
source: PRG ROM (program):
ru: PRG ROM (программа):

# ChrRom.Label
source: CHR ROM (graphics):
ru: CHR ROM (графика):

# Mapper.Info.Title
source: Mapper and configuration
ru: Маппер и конфигурация

# Graphics.Title
source: 🎨 Graphics (CHR ROM)
ru: 🎨 Графика (CHR ROM)

# Palette.Label
source: Palette:
ru: Палитра:

# Palette.Tooltip
source: Select a color palette. Greyscale is a neutral option.
ru: Выберите цветовую палитру. Greyscale - честный способ без цвета.

# Transparency.Label
source: Transparency
ru: Прозрачность

# Transparency.Tooltip
source: Show index 0 as transparent (checkerboard)
ru: Показать индекс 0 как прозрачный (шахматный фон)

source: Zoom out
ru: Уменьшить масштаб

source: Zoom in
ru: Увеличить масштаб

# Zoom.Reset
source: Reset zoom
ru: Сбросить масштаб

source: 📥 Export tile sheet
ru: 📥 Экспорт панно

# Export.TileSheet.Tooltip
source: Save all tiles into a single PNG file
ru: Сохранить все тайлы в один PNG файл

# Export.Tiles
source: 📂 Export to individual files
ru: 📂 Экспорт в отдельные файлы

# Export.Tiles.Tooltip
source: Save each tile as a separate PNG file
ru: Сохранить каждый тайл в отдельный PNG файл

# NoChr.Title
source: CHR ROM is missing
ru: CHR ROM отсутствует

# NoChr.Subtitle
source: This cartridge uses CHR RAM
ru: Этот картридж использует CHR RAM

# NoChr.InfoTitle
source: ℹ️ What does it mean?
ru: ℹ️ Что это значит?

# NoChr.InfoBody1
source: Graphics are not stored in the ROM file but are uploaded by the game at runtime into the CHR RAM on the cartridge.
ru: Графические данные не хранятся в ROM файле, а загружаются игрой во время выполнения в CHR RAM на картридже.

# NoChr.InfoBody2
source: Many games with mappers MMC1, MMC3, MMC5 and others use this approach (Duck Tales, Mega Man, Kirby's Adventure, etc.)
ru: Такой подход используют многие игры с мапперами MMC1, MMC3, MMC5 и другими (Duck Tales, Mega Man, Kirby's Adventure и т.д.)

# NoChr.Hint
source: 💡 To extract graphics from such games, you need emulation and intercept writes into CHR RAM.
ru: 💡 Для извлечения графики из таких игр требуется эмуляция и перехват записи в CHR RAM.

# Graphics.TileCount
source: Total tiles: {0} ({1:F2} banks)
ru: Всего тайлов: {0} ({1:F2} банков)

# Export.TileSheet.DialogTitle
source: Export tile sheet
ru: Экспорт панно

# Export.TileSheet.FileType
source: PNG image
ru: PNG изображение

# Export.Tiles.DialogTitle
source: Select a folder to export tiles
ru: Выберите папку для экспорта тайлов

# Export.Batch.DialogTitle
source: Select a folder for batch export
ru: Выберите папку для массового экспорта

# Export.Batch.Processing
source: Processing {0} of {1}...
ru: Обработка {0} из {1}...

# Export.Batch.Success
source: Batch export completed successfully
ru: Массовый экспорт успешно завершен

# Error.Export
source: Error during export: {0}
ru: Ошибка при экспорте: {0}

# Error.BatchExport
source: Error during batch export: {0}
ru: Ошибка при массовом экспорте: {0}

# Error.NoFiles
source: No files to export
ru: Нет файлов для экспорта

# Dialog.OpenFile.Title
source: Select NES ROM file
ru: Выберите NES ROM файл

# Dialog.OpenFile.Filter.Nes
source: NES ROM files
ru: Файлы NES ROM

# Dialog.OpenFile.Filter.All
source: All files
ru: Все файлы

# Error.OpenFile
source: Error opening file: {0}
ru: Ошибка при открытии файла: {0}

# Error.FileNotFound
source: File not found: {0}
ru: Файл не найден: {0}

# Error.InvalidFormat
source: Invalid file format: {0}
ru: Неверный формат файла: {0}

# Error.LoadFile
source: Error loading file: {0}
ru: Ошибка при загрузке файла: {0}
